In [1]:
#pip install pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
#Pandas Series

In [4]:
df=pd.Series([1,3,4,5,6,7,10])

In [5]:
df

0     1
1     3
2     4
3     5
4     6
5     7
6    10
dtype: int64

In [6]:
type(df)

pandas.core.series.Series

In [7]:
df.head()

0    1
1    3
2    4
3    5
4    6
dtype: int64

In [8]:
df.tail()

2     4
3     5
4     6
5     7
6    10
dtype: int64

In [9]:
#pandas dataframe- Using Numpy Dataset
data= np.arange(0,20).reshape(5,4)

In [10]:
df=pd.DataFrame(data,index=["r1","r2","r3","r4","r5"],columns=["column1","column2","column3","column4"])

In [11]:
df

    column1  column2  column3  column4
r1        0        1        2        3
r2        4        5        6        7
r3        8        9       10       11
r4       12       13       14       15
r5       16       17       18       19

In [12]:
#accesing the rows
df.loc[["r1","r4"]]

    column1  column2  column3  column4
r1        0        1        2        3
r4       12       13       14       15

In [13]:
#df.iloc[start:end,start:end]
#for accessing the rows and columns as we needed
df.iloc[0:,2:]

    column3  column4
r1        2        3
r2        6        7
r3       10       11
r4       14       15
r5       18       19

In [14]:
df.iloc[2:,1:]

    column2  column3  column4
r3        9       10       11
r4       13       14       15
r5       17       18       19

In [15]:
df[["column1","column3"]]

    column1  column3
r1        0        2
r2        4        6
r3        8       10
r4       12       14
r5       16       18

In [16]:
#pandas DataFrame using Dict
data={
    "calories":[420,320,390,400],
    "duration":[28,45,67,23]

}
df=pd.DataFrame(data)
df

   calories  duration
0       420        28
1       320        45
2       390        67
3       400        23

In [17]:
#Panadas DataFrame - Using CSV
pd.read_csv()

TypeError: read_csv() missing 1 required positional argument: 'filepath_or_buffer'

In [ ]:
df.dtype
df.size
df.describe()
df.index
df.coloumn

In [ ]:
#missing value info
#df.isna().sum()

In [ ]:
df= pd.read_csv('data/dirtydata.csv')
df.dropna(inplace= True)
print(df)

In [ ]:
df= pd.read_csv('data/dirtydata.csv')

In [ ]:
df

In [ ]:
 x=df["Calories"].mean()

In [ ]:
 df["Calories"].fillna(x, inplace = True)

In [ ]:
df

In [ ]:
df= pd.read_csv('data/dirtydata.csv')

In [ ]:
x=df["Calories"].median()

In [ ]:
df["Calories"].fillna(x,inplace=True)

In [ ]:
df

In [ ]:
df= pd.read_csv('data/dirtydata.csv')

In [ ]:
df["Calories"].mode()[0]
#mode-most repeated values

In [ ]:
import pandas as pd
df= pd.read_csv('data/dirtydata.csv')

In [ ]:
x=df["Duration"].mode()[0]

In [ ]:
df.loc[7,"Duration"]=x

In [ ]:
for x in  df.index:
    print("the index is :",x)
    if df.loc[x,"Duration"]==60: 
        print(df.loc[x,"Duration"])
        df.loc[x,"Duration"]=50
        print("the updated value:", df.loc[x,"Duration"])
        print("===== /n")

In [ ]:
df.loc[df.index]

In [ ]:
df.reset_index(drop=True,inplace=True)

In [ ]:
df

In [ ]:
df.reset_index(drop=True,inplace=True)

In [ ]:
df

In [ ]:
import pandas as pd
data= pd.read_csv("data/supermarket_sales.csv")
data

In [ ]:
data.dtypes

In [ ]:
data.info()

In [ ]:
data.head()

In [ ]:
data.tail()

In [ ]:
#TO CALCULATE THE MEAN OF GROSS INCOME 

data['gross income'].mean()

In [ ]:
data['gross income'].median()

In [ ]:
data['Gender'].mode()

In [ ]:
data['Gender'].value_counts()

In [ ]:
data['Gender'].nunique()

In [ ]:
data.describe(include='O')

In [ ]:
 #create a function 
    #arg= data

In [ ]:
data.isna()

In [ ]:
data

In [ ]:
totalGrossincome=data['gross income'].sum()
print("TotalGrossincome",totalGrossincome)

In [ ]:
#which is the most commonly uswd payment method
payment= data['Payment'].mode()[0]
print("most commonly used payment type is :",payment)

In [ ]:
#what is the average unit price of the products ?
averagevalue=data['Unit price'].mean()
print(f"the average unit price of the product is {averagevalue}")

In [ ]:
#what is the standard deviation of the unit price?
stanadardDeviation=data['Unit price'].std()
print(f"the standard deviation of unit price is {stanadardDeviation}")

In [ ]:
#problem 2
data=pd.read_csv("data/adult.csv")
data

In [ ]:
data.isnull().sum()

In [ ]:
#average work hour per week
data['hours-per-week'].mean()

In [ ]:
#avaerage work hour for male and feamle 
data.groupby('gender')['hours-per-week'].mean()

In [ ]:

data['workclass'].unique()

In [ ]:
data['workclass'].dtype

In [ ]:
data.groupby(['workclass','gender'])['hours-per-week'].mean()

In [ ]:
data['race'].value_counts()

In [ ]:
data.groupby(['race','workclass','gender'])['hours-per-week'].mean()

In [ ]:
pd.set_option('display.max_rows',100)

In [ ]:
n1=data.groupby(['race','workclass','gender'])['hours-per-week'].mean()

In [ ]:
outputDf=data.groupby(['race','workclass','gender'])['hours-per-week','age'].mean()

In [ ]:
type(outputDf)

In [ ]:
outputDf.to_csv('sample1')

In [ ]:
#pandas merging ,joining,and concatenating

In [18]:
df_customer=pd.DataFrame({
    'id':[1,2,3,4],
    'name':['tom','jenny','james','dan']
})
df_info=pd.DataFrame({
    'id':[2,3,4,5],
    'age':[31,20,40,70],
    'sex':['F','M','M','F']
})

In [19]:
df_customer

   id   name
0   1    tom
1   2  jenny
2   3  james
3   4    dan

In [20]:
pd.merge(df_customer,df_info)

   id   name  age sex
0   2  jenny   31   F
1   3  james   20   M
2   4    dan   40   M

In [21]:
pd.merge(df_customer,df_info,on='id')

   id   name  age sex
0   2  jenny   31   F
1   3  james   20   M
2   4    dan   40   M

In [22]:
df_order = pd.DataFrame({
    'id': [2,3,4,5],
    'name': ['Jenny', 'James', 'Dan', 'leo'],
    'quantity': [2,4,6,10]
})
df_order

   id   name  quantity
0   2  Jenny         2
1   3  James         4
2   4    Dan         6
3   5    leo        10